
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 2 to destroy.</code></pre>

* Create
  * module.keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-dtu-id&#34;]
  * module.keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-dtu-pwd&#34;]
* Update
  * module.kv_hmi.azurerm_monitor_diagnostic_setting.kv-ds
* Delete
  * module.keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-rota-dtu-id&#34;]
  * module.keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret[&#34;hmi-rota-dtu-pwd&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret["hmi-dtu-id"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + content_type            = ""
      + expiration_date         = "2024-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg"
      + name                    = "hmi-dtu-id"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "BuiltFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "application"         = "hearings-management-interface"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
          + "source"              = "bootstrap hmi-bootstrap-kv-stg secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret["hmi-dtu-pwd"] will be created
  + resource "azurerm_key_vault_secret" "secret" {
      + content_type            = ""
      + expiration_date         = "2024-03-01T01:00:00Z"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg"
      + name                    = "hmi-dtu-pwd"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "BuiltFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          + "application"         = "hearings-management-interface"
          + "businessArea"        = "Cross-Cutting"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "staging"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
          + "source"              = "bootstrap hmi-bootstrap-kv-stg secrets"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret["hmi-rota-dtu-id"] will be destroyed
  # (because key ["hmi-rota-dtu-id"] is not in for_each map)
  - resource "azurerm_key_vault_secret" "secret" {
      - content_type            = "" -> null
      - expiration_date         = "2024-03-01T01:00:00Z" -> null
      - id                      = "https://hmi-kv-stg.vault.azure.net/secrets/hmi-rota-dtu-id/10fb538fbdc14242bfb141a8147833ef" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg" -> null
      - name                    = "hmi-rota-dtu-id" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg/secrets/hmi-rota-dtu-id/versions/10fb538fbdc14242bfb141a8147833ef" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg/secrets/hmi-rota-dtu-id" -> null
      - tags                    = {
          - "BuiltFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          - "application"         = "hearings-management-interface"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#hearing-management-information"
          - "environment"         = "staging"
          - "managedBy"           = "Future Hearings - Hearing Management Information"
          - "source"              = "bootstrap hmi-bootstrap-kv-stg secrets"
        } -> null
      - value                   = (sensitive value)
      - version                 = "10fb538fbdc14242bfb141a8147833ef" -> null
      - versionless_id          = "https://hmi-kv-stg.vault.azure.net/secrets/hmi-rota-dtu-id" -> null
    }

  # module.keyvault_bootstrap_secrets.azurerm_key_vault_secret.secret["hmi-rota-dtu-pwd"] will be destroyed
  # (because key ["hmi-rota-dtu-pwd"] is not in for_each map)
  - resource "azurerm_key_vault_secret" "secret" {
      - content_type            = "" -> null
      - expiration_date         = "2024-03-01T01:00:00Z" -> null
      - id                      = "https://hmi-kv-stg.vault.azure.net/secrets/hmi-rota-dtu-pwd/19be4840ad7c4581af7b9f7b7ff4933e" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg" -> null
      - name                    = "hmi-rota-dtu-pwd" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg/secrets/hmi-rota-dtu-pwd/versions/19be4840ad7c4581af7b9f7b7ff4933e" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg/secrets/hmi-rota-dtu-pwd" -> null
      - tags                    = {
          - "BuiltFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
          - "application"         = "hearings-management-interface"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#hearing-management-information"
          - "environment"         = "staging"
          - "managedBy"           = "Future Hearings - Hearing Management Information"
          - "source"              = "bootstrap hmi-bootstrap-kv-stg secrets"
        } -> null
      - value                   = (sensitive value)
      - version                 = "19be4840ad7c4581af7b9f7b7ff4933e" -> null
      - versionless_id          = "https://hmi-kv-stg.vault.azure.net/secrets/hmi-rota-dtu-pwd" -> null
    }

  # module.kv_hmi.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg|hmi-kv-stg"
        name                       = "hmi-kv-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":17,"Program":"tfcmt","SHA1":"","Vars":{}} -->